#Дано целое число N (>0). Найти произведение 1.1 • 1.2 • 1.3 •... (N сомножителей)
#запрашиваем число
#N = int(input("Введите число сомножителей: "))
#проводим проверку
#while type(N) != int:
#     try:
#         N != int(N)
#     except ValueError:
#         print("Неправильно ввели")
#         N = int(input("Введите число сомножителей: "))
# product = 1 #начальное значение
# i = 1 #счетчик
# #цикл для вычесления
# while i <= N:
#         product *= (1 + i * 0.1)  # Умножаем на текущий сомножитель
#         i += 1                    # Увеличиваем счетчик
# print("произведение", product)

g = 3
d = g
print(g)
g = 4
print(d) 