#Дана масса в килограммах. Используя операцию деления нацело
#найти кол-во полных тонн в ней(1 тонна = 1000кг)
mass = int(input("Введите количество килограмм: "))
#запрашиваем число
print("тонн -", mass//1000)
#выводим число делённое на 1000
